Revit 2027 API
SunAndShadowSettings.IsAfterStartDateAndTime Method
 Checks whether the end date and time is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAfterStartDateAndTime(
	DateTime time
)
Public Function IsAfterStartDateAndTime (
	time As DateTime
) As Boolean
public:
bool IsAfterStartDateAndTime(
	DateTime time
)
member IsAfterStartDateAndTime :
        time : DateTime -> bool
Parameters
time DateTime
 Date and time value
Return Value
Boolean
 True if the date and time is valid, false otherwise.
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace